RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_snflash.c
/**
  ******************************************************************************
  * @file    bl702_snflash.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl702_snflash.h"
#include "bl702_psram.h"

#define PSRAM_ADDR            (0x24000000)
#define DISK_SECTOR_SIZE      (512)
#define PSRAM_READ_ERITE_SIZE (256)

static void Nandflash_Erase(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t blockNum);
static void Nandflash_PageReadToPsram(uint32_t addr, uint32_t len);
static void ATTR_TCM_SECTION Nandflash_Psram_Write(uint8_t *buff, uint32_t len, uint32_t psramWriteOffsite);
static void ATTR_TCM_SECTION Nandflash_Psram_Read(uint8_t *buff, uint32_t readLen, uint32_t psramReadOffsite);
static void Nandflash_PageWriteToPsram(const uint8_t *buff, uint32_t addr, uint32_t len);
static void Nandflash_PageProgramFromPsram(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t blockNum);

NANDFLASH_CFG_Type nfCfg = {
    .spiNo = SPI_ID_0,
    .spiCfg = {
        DISABLE,                      /* Disable de-glitch function */
        DISABLE,                      /* Disable master continuous transfer mode */
        SPI_BYTE_INVERSE_BYTE0_FIRST, /* The byte 0 is sent first in SPI transfer */
        SPI_BIT_INVERSE_MSB_FIRST,    /* MSB is sent first in SPI transfer */
        SPI_CLK_PHASE_INVERSE_0,      /* SPI clock phase */
        SPI_CLK_POLARITY_LOW,         /* SPI clock plarity */
        SPI_FRAME_SIZE_8              /* SPI frame size 8-bit(also the valid width for each fifo entry) */
    },
    .clockCfg = {
        1, /* Length of start condition */
        1, /* Length of stop condition */
        1, /* Length of data phase 0,affecting clock */
        1, /* Length of data phase 1,affecting clock */
        1  /* Length of interval between frame */
    }
};

static void ATTR_TCM_SECTION Nandflash_Psram_Write(uint8_t *buff, uint32_t len, uint32_t psramWriteOffsite)
{
    uint32_t i = 0;
    uint32_t psramStartAddr = PSRAM_ADDR + psramWriteOffsite;

    for (i = 0; i < len / PSRAM_READ_ERITE_SIZE; i++) {
        BL702_MemCpy_Fast((void *)(psramStartAddr + i * PSRAM_READ_ERITE_SIZE), buff, PSRAM_READ_ERITE_SIZE);
        buff += PSRAM_READ_ERITE_SIZE;
    }

    /*if len is not an integral multiple of PSRAM_READ_ERITE_SIZE need memcpy once again*/
    if (len % PSRAM_READ_ERITE_SIZE != 0) {
        BL702_MemCpy_Fast((void *)(psramStartAddr + i * PSRAM_READ_ERITE_SIZE), buff, len % PSRAM_READ_ERITE_SIZE);
        buff += (len % PSRAM_READ_ERITE_SIZE);
    }
}

static void ATTR_TCM_SECTION Nandflash_Psram_Read(uint8_t *buff, uint32_t readLen, uint32_t psramReadOffsite)
{
    uint32_t i = 0;
    uint32_t psramStartAddr = PSRAM_ADDR + psramReadOffsite;

    for (i = 0; i < readLen / PSRAM_READ_ERITE_SIZE; i++) {
        BL702_MemCpy_Fast(buff, (void *)(psramStartAddr + i * PSRAM_READ_ERITE_SIZE), PSRAM_READ_ERITE_SIZE);
        buff += PSRAM_READ_ERITE_SIZE;
    }

    /*if len is not an integral multiple of PSRAM_READ_ERITE_SIZE need memcpy once again*/
    if (readLen % PSRAM_READ_ERITE_SIZE != 0) {
        BL702_MemCpy_Fast(buff, (void *)(psramStartAddr + i * PSRAM_READ_ERITE_SIZE), readLen % PSRAM_READ_ERITE_SIZE);
    }
}

void ATTR_TCM_SECTION Nandflash_Psram_Cfg()
{
    GLB_GPIO_Cfg_Type gpioCfg = {
        .gpioPin = GLB_GPIO_PIN_17,
        .gpioFun = GPIO17_FUN_SF_IO_0_SF2_CS2,
        .gpioMode = GPIO_MODE_OUTPUT,
        .pullType = GPIO_PULL_UP,
        .drive = 3,
        .smtCtrl = 1,
    };

    SPI_Psram_Cfg_Type apMemory1604 = {
        .readIdCmd = 0x9F,
        .readIdDmyClk = 0,
        .burstToggleCmd = 0xC0,
        .resetEnableCmd = 0x66,
        .resetCmd = 0x99,
        .enterQuadModeCmd = 0x35,
        .exitQuadModeCmd = 0xF5,
        .readRegCmd = 0xB5,
        .readRegDmyClk = 1,
        .writeRegCmd = 0xB1,
        .readCmd = 0x03,
        .readDmyClk = 0,
        .fReadCmd = 0x0B,
        .fReadDmyClk = 1,
        .fReadQuadCmd = 0xEB,
        .fReadQuadDmyClk = 3,
        .writeCmd = 0x02,
        .quadWriteCmd = 0x38,
        .pageSize = 512,
        .ctrlMode = PSRAM_SPI_CTRL_MODE,
        .driveStrength = PSRAM_DRIVE_STRENGTH_50_OHMS,
        .burstLength = PSRAM_BURST_LENGTH_512_BYTES,
    };

    SF_Ctrl_Cmds_Cfg cmdsCfg = {
        .cmdsEn = ENABLE,
        .burstToggleEn = ENABLE,
        .wrapModeEn = DISABLE,
        .wrapLen = SF_CTRL_WRAP_LEN_512,
    };

