RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_snflash.c
    SF_Ctrl_Psram_Cfg sfCtrlPsramCfg = {
        .owner = SF_CTRL_OWNER_SAHB,
        .padSel = SF_CTRL_PAD_SEL_DUAL_CS_SF2,
        .bankSel = SF_CTRL_SEL_PSRAM,
        .psramRxClkInvertSrc = ENABLE,
        .psramRxClkInvertSel = ENABLE,
        .psramDelaySrc = ENABLE,
        .psramClkDelay = 0,
    };
    uint8_t psramId[8] = { 0 };
    uint32_t wt_en = 1;
    uint32_t wb_en = 0;
    uint32_t wa_en = 0;
    uint32_t i = 0;

    GLB_GPIO_Init(&gpioCfg);

    Psram_Init(&apMemory1604, &cmdsCfg, &sfCtrlPsramCfg);
    Psram_SoftwareReset(&apMemory1604, apMemory1604.ctrlMode);
    Psram_ReadId(&apMemory1604, psramId);

    Psram_Cache_Write_Set(&apMemory1604, SF_CTRL_QIO_MODE, wt_en, wb_en, wa_en);
    L1C_Cache_Enable_Set(0x0f);
}

void Nandflash_Gpio_Init(GLB_GPIO_Type clk, GLB_GPIO_Type mosi, GLB_GPIO_Type miso)
{
    GLB_GPIO_Cfg_Type gpioCfg = {
        .gpioPin = GLB_GPIO_PIN_0,
        .gpioFun = GPIO_FUN_SPI0,
        .gpioMode = GPIO_MODE_OUTPUT,
        .pullType = GPIO_PULL_NONE,
        .drive = 0,
        .smtCtrl = 1
    };

    /* cs */
    gpioCfg.gpioPin = SPI_PIN_CS;
    gpioCfg.gpioFun = 11;
    GLB_GPIO_Init(&gpioCfg);
    GLB_GPIO_INPUT_Disable(gpioCfg.gpioPin);
    GLB_GPIO_OUTPUT_Enable(gpioCfg.gpioPin);
    Nandflash_CS_High();

    /* clk */
    gpioCfg.gpioPin = clk;
    gpioCfg.gpioFun = GPIO_FUN_SPI0;
    GLB_GPIO_Init(&gpioCfg);
    GLB_GPIO_INPUT_Disable(gpioCfg.gpioPin);
    GLB_GPIO_OUTPUT_Enable(gpioCfg.gpioPin);

    /* mosi */
    gpioCfg.gpioPin = mosi;
    gpioCfg.gpioFun = GPIO_FUN_SPI0;
    GLB_GPIO_Init(&gpioCfg);
    GLB_GPIO_INPUT_Enable(gpioCfg.gpioPin);
    GLB_GPIO_OUTPUT_Enable(gpioCfg.gpioPin);

    /* miso */
    gpioCfg.gpioPin = miso;
    gpioCfg.gpioFun = GPIO_FUN_SPI0;
    GLB_GPIO_Init(&gpioCfg);
    GLB_GPIO_INPUT_Enable(gpioCfg.gpioPin);
    GLB_GPIO_OUTPUT_Enable(gpioCfg.gpioPin);

    GLB_Set_SPI_0_ACT_MOD_Sel(GLB_SPI_PAD_ACT_AS_MASTER);
}

void Nandflash_CS_High(void)
{
    GLB_GPIO_Write(SPI_PIN_CS, 1);
}

void Nandflash_CS_Low(void)
{
    GLB_GPIO_Write(SPI_PIN_CS, 0);
}

void Nandflash_Clock_Init(uint8_t enable, uint8_t div)
{
    GLB_Set_SPI_CLK(enable, div);
    GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_SPI);
}

void Nandflash_SPI_Init(NANDFLASH_CFG_Type *pNandflashCfg)
{
    SPI_Disable(SPI_ID_0, SPI_WORK_MODE_MASTER);
    SPI_IntMask(SPI_ID_0, SPI_INT_ALL, MASK);
    SPI_Init(pNandflashCfg->spiNo, &(pNandflashCfg->spiCfg));
    SPI_ClockConfig(pNandflashCfg->spiNo, &(pNandflashCfg->clockCfg));
    SPI_Enable(SPI_ID_0, SPI_WORK_MODE_MASTER);
}

void Nandflash_SendRecv(NANDFLASH_CFG_Type *pNandflashCfg, uint8_t *sendBuff, uint8_t *recvBuff, uint32_t len)
{
    SPI_SendRecv_8bits(pNandflashCfg->spiNo, sendBuff, recvBuff, len, SPI_TIMEOUT_DISABLE);
}

void Nandflash_WriteEnable(NANDFLASH_CFG_Type *pNandflashCfg)
{
    uint8_t cmd[1] = { 0 };
    uint8_t pBlockLock = 0xff;

    cmd[0] = NANDFLASH_WRITE_ENABLE;
    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 1, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    /*check block lock status*/
    Nandflash_Get_BlockLock(pNandflashCfg, &pBlockLock);

    if (pBlockLock != 0) {
        // MSG_ERR("Get BlockLock in Nandflash Write Enable and return %0x\r\n", pBlockLock);
    }
}

void Nandflash_WriteDisable(NANDFLASH_CFG_Type *pNandflashCfg)
{
    uint8_t cmd[1] = { 0 };

    cmd[0] = NANDFLASH_WRITE_DISABLE;
    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 1, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();
}

void Nandflash_Get_BlockLock(NANDFLASH_CFG_Type *pNandflashCfg, uint8_t *pBlockLock)
{
    uint8_t cmd[2] = { 0 };
    uint8_t ack[1] = { 0 };

    cmd[0] = NANDFLASH_GET_FEATURES;
    cmd[1] = NANDFLASH_BLOCK_LOCK_ADDR;

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 2, SPI_TIMEOUT_DISABLE);
    SPI_Recv_8bits(pNandflashCfg->spiNo, ack, 1, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    *pBlockLock = ack[0];
}

void Nandflash_Set_BlockLock(NANDFLASH_CFG_Type *pNandflashCfg, uint8_t *pBlockLock)
{
    uint8_t cmd[3] = { 0 };

    cmd[0] = NANDFLASH_SET_FEATURES;
    cmd[1] = NANDFLASH_BLOCK_LOCK_ADDR;
    cmd[2] = *pBlockLock;

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 3, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();
}

void Nandflash_Get_Feature(NANDFLASH_CFG_Type *pNandflashCfg, uint8_t *pFeature)
{
    uint8_t cmd[2] = { 0 };
    uint8_t ack[1] = { 0 };

    cmd[0] = NANDFLASH_GET_FEATURES;
    cmd[1] = NANDFLASH_FEATURE_ADDR;

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 2, SPI_TIMEOUT_DISABLE);
    SPI_Recv_8bits(pNandflashCfg->spiNo, ack, 1, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    *pFeature = ack[0];
}

void Nandflash_Set_Feature(NANDFLASH_CFG_Type *pNandflashCfg, uint8_t *pFeature)
{
    uint8_t cmd[3] = { 0 };

    cmd[0] = NANDFLASH_GET_FEATURES;
    cmd[1] = NANDFLASH_FEATURE_ADDR;
    cmd[2] = *pFeature;

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 3, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();
}

void Nandflash_Get_Status(NANDFLASH_CFG_Type *pNandflashCfg, uint8_t *pStatus)
{
    uint8_t cmd[2] = { 0 };
    uint8_t ack[1] = { 0 };

    cmd[0] = NANDFLASH_GET_FEATURES;
    cmd[1] = NANDFLASH_STATUS_ADDR;

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 2, SPI_TIMEOUT_DISABLE);
    SPI_Recv_8bits(pNandflashCfg->spiNo, ack, 1, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    *pStatus = ack[0];
}

void Nandflash_Set_Status(NANDFLASH_CFG_Type *pNandflashCfg, uint8_t *pStatus)
{
    uint8_t cmd[3] = { 0 };

    cmd[0] = NANDFLASH_GET_FEATURES;
    cmd[1] = NANDFLASH_STATUS_ADDR;
    cmd[2] = *pStatus;

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 3, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();
}

NANDFLASH_ECC_Type Nandflash_CheckBadBlock(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t blockNum, uint8_t *buff, uint32_t len)
{
    uint32_t pageNum = 0, pageAddr = 0;
    NANDFLASH_ECC_Type ecc = 0;

