RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_snflash.c
    pageNum = blockNum * NANDFLASH_PAGES_PER_BLOCK;

    pageAddr = pageNum * NANDFLASH_PAGE_SIZE;

    if (len) {
        //read to cache
        ecc = Nandflash_PageReadToCache(pNandflashCfg, pageAddr);

        /* read from cache */
        Nandflash_ReadFromCache(pNandflashCfg, NANDFLASH_PAGE_SIZE, buff, len);
    }

    return ecc;
}

NANDFLASH_ECC_Type Nandflash_PageRead(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t addr, uint8_t *buff, uint32_t len)
{
    NANDFLASH_ECC_Type ecc = 0;
    uint32_t pageAddr = addr & 0xFFFFF800;
    uint32_t readLen = 0;
    uint32_t pageOffset = addr - pageAddr;

    if ((pageOffset + len) <= NANDFLASH_PAGE_SIZE) {
        readLen = len;
    } else {
        readLen = NANDFLASH_PAGE_SIZE - pageOffset;
    }

    memset(buff, 0, len);

    if (readLen) {
        /* read to cache */
        ecc = Nandflash_PageReadToCache(pNandflashCfg, pageAddr);

        /* read from cache */
        Nandflash_ReadFromCache(pNandflashCfg, pageOffset, buff, readLen);
    }

    return ecc;
}

NANDFLASH_ECC_Type Nandflash_PagesRead(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t addr, uint8_t *buff, uint32_t len)
{
    NANDFLASH_ECC_Type ecc = 0;
    uint32_t startPageNum = 0, endPageNum = 0, absolutePageNum = 0;
    uint32_t readLen = 0, pageOffset = 0, beginAddr = addr;

    startPageNum = addr / NANDFLASH_PAGE_SIZE;
    endPageNum = (addr + len - 1) / NANDFLASH_PAGE_SIZE;

    memset(buff, 0, len);

    if (len > 0) {
        for (absolutePageNum = startPageNum; absolutePageNum <= endPageNum; absolutePageNum++) {
            pageOffset = addr % NANDFLASH_PAGE_SIZE;

            if (absolutePageNum == startPageNum) {
                if (beginAddr + len >= NANDFLASH_PAGE_SIZE) {
                    readLen = (startPageNum + 1) * NANDFLASH_PAGE_SIZE - beginAddr;
                } else {
                    readLen = len;
                }
            } else if ((startPageNum < absolutePageNum) && (absolutePageNum < endPageNum)) {
                readLen = NANDFLASH_PAGE_SIZE;
            } else if (absolutePageNum == endPageNum) {
                readLen = (beginAddr + len) - (endPageNum * NANDFLASH_PAGE_SIZE);
            }

            /* read to cache */
            ecc = Nandflash_PageReadToCache(pNandflashCfg, absolutePageNum * NANDFLASH_PAGE_SIZE);
            /* read from cache */
            Nandflash_ReadFromCache(pNandflashCfg, pageOffset, buff, readLen);

            addr = (absolutePageNum + 1) * NANDFLASH_PAGE_SIZE;
            buff += readLen;
        }
    }

    return ecc;
}
NANDFLASH_ECC_Type Nandflash_PageReadToCache(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t addr)
{
    uint8_t feature = 0;
    uint8_t cmd[4] = { 0 };
    uint8_t status = 0xff;
    uint8_t pBlockLock = 0xff;
    NANDFLASH_ECC_Type ecc = 0;
    uint32_t blockNum = 0;
    uint32_t pageNum = 0;
    uint32_t absolutePageNum = 0;
    uint16_t cmds = 0;
    /* enable ECC */
    Nandflash_Get_Feature(pNandflashCfg, &feature);
    ((NANDFLASH_FEATURE_Type *)(&feature))->ECC_EN = 1;
    Nandflash_Set_Feature(pNandflashCfg, &feature);

    absolutePageNum = addr / NANDFLASH_PAGE_SIZE;
    blockNum = absolutePageNum / NANDFLASH_PAGES_PER_BLOCK;
    pageNum = absolutePageNum % NANDFLASH_PAGES_PER_BLOCK;
    /* page read to cache */
    cmd[0] = NANDFLASH_PAGE_READ_TO_CACHE;
    cmd[1] = NANDFLASH_DUMMY_BYTE;
    cmds = (uint16_t)(blockNum << 6) | (uint16_t)pageNum;
    cmd[2] = (uint8_t)(cmds >> 8);
    cmd[3] = (uint8_t)(cmds >> 0);
    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 4, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    /*check block lock status*/
    Nandflash_Get_BlockLock(pNandflashCfg, &pBlockLock);

    if (pBlockLock != 0) {
        // MSG_ERR("Get BlockLock in Nandflash PageRead To Cache and return %0x\r\n", pBlockLock);
    }

    BL702_Delay_MS(20);

    /* Operation In Progress */
    do {
        Nandflash_Get_Status(pNandflashCfg, &status);
    } while ((((NANDFLASH_STATUS_Type *)(&status))->OIP));

    /* get ecc */
    Nandflash_Get_Status(pNandflashCfg, &status);
    ecc = status;

    return ecc;
}

void Nandflash_ReadFromCache(NANDFLASH_CFG_Type *pNandflashCfg, uint16_t offset, uint8_t *buff, uint32_t len)
{
    uint32_t readLen = len;
    uint8_t cmd[4] = { 0 };
    uint8_t pBlockLock = 0xff;

    if (!buff) {
        return;
    }

    if (readLen > NANDFLASH_PAGE_SIZE) {
        readLen = NANDFLASH_PAGE_SIZE;
    }

    /* read from cache */
    cmd[0] = NANDFLASH_READ_FROM_CACHE;
    cmd[1] = (uint8_t)((offset >> 8) & 0x0F);
    cmd[2] = (uint8_t)((offset >> 0) & 0xFF);
    cmd[3] = NANDFLASH_DUMMY_BYTE;

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 4, SPI_TIMEOUT_DISABLE);
    SPI_Recv_8bits(pNandflashCfg->spiNo, buff, readLen, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    /*check block lock status*/
    Nandflash_Get_BlockLock(pNandflashCfg, &pBlockLock);

    if (pBlockLock != 0) {
        // MSG_ERR("Get BlockLock in Nandflash Read From Cache Erase and return %0x\r\n", pBlockLock);
    }
}

void Nandflash_ReadID(NANDFLASH_CFG_Type *pNandflashCfg, uint8_t *pManufactureID, uint8_t *pDeviceID)
{
    uint8_t cmd[2] = { 0 };
    uint8_t ack[2] = { 0 };

    cmd[0] = NANDFLASH_READ_ID;
    cmd[1] = NANDFLASH_DUMMY_BYTE;

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 2, SPI_TIMEOUT_DISABLE);
    SPI_Recv_8bits(pNandflashCfg->spiNo, ack, 2, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    *pManufactureID = ack[0];
    *pDeviceID = ack[1];
}

void Nandflash_PageProgram(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t addr, const uint8_t *buff, uint32_t len)
{
    uint32_t pageAddr = addr & 0xFFFFF800;
    uint32_t writeLen = 0;
    uint32_t pageOffset = addr - pageAddr;

    if ((pageOffset + len) <= NANDFLASH_PAGE_SIZE) {
        writeLen = len;
    } else {
        writeLen = NANDFLASH_PAGE_SIZE - pageOffset;
    }

    if (writeLen) {
        /* program load */
        Nandflash_ProgramLoad(pNandflashCfg, pageOffset, buff, writeLen);

