RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_snflash.c
        /* write enable */
        Nandflash_WriteEnable(pNandflashCfg);

        /* program execute */
        Nandflash_ProgramExecute(pNandflashCfg, pageAddr);
    }

    return;
}

void Nandflash_PagesProgram(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t addr, const uint8_t *buff, uint32_t len)
{
    int32_t startPageNum = 0, endPageNum = 0, absolutePageNum = 0;
    uint32_t writeLen = 0, pageAddr = 0;
    uint32_t pageOffset = 0, begin_addr = addr;

    startPageNum = addr / NANDFLASH_PAGE_SIZE;
    endPageNum = (addr + len - 1) / NANDFLASH_PAGE_SIZE;

    if (len > 0) {
        for (absolutePageNum = startPageNum; absolutePageNum <= endPageNum; absolutePageNum++) {
            pageOffset = 0;
            pageAddr = absolutePageNum * NANDFLASH_PAGE_SIZE;

            if (absolutePageNum == startPageNum) {
                if (begin_addr + len >= NANDFLASH_PAGE_SIZE) {
                    writeLen = (startPageNum + 1) * NANDFLASH_PAGE_SIZE - begin_addr;
                } else {
                    writeLen = len;
                }

                pageOffset = begin_addr % NANDFLASH_PAGE_SIZE;
            } else if ((startPageNum < absolutePageNum) && (absolutePageNum < endPageNum)) {
                writeLen = NANDFLASH_PAGE_SIZE;
                pageOffset = 0;
            } else if (absolutePageNum == endPageNum) {
                writeLen = (begin_addr + len) - (endPageNum * NANDFLASH_PAGE_SIZE);
                pageOffset = 0;
            }

            if (writeLen) {
                /* program load */
                Nandflash_ProgramLoad(pNandflashCfg, pageOffset, buff, writeLen);

                /* write enable */
                Nandflash_WriteEnable(pNandflashCfg);

                /* program execute */
                Nandflash_ProgramExecute(pNandflashCfg, pageAddr);
            }

            buff += writeLen;
        }
    }
}

void Nandflash_ProgramLoad(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t pageOffset, const uint8_t *buff, uint32_t len)
{
    uint8_t cmd[3] = { 0 };
    uint32_t writeLen = len;
    uint8_t pBlockLock = 0xff;

    if (!buff) {
        return;
    }

    if (len > NANDFLASH_PAGE_SIZE) {
        writeLen = NANDFLASH_PAGE_SIZE;
    } else {
    }

    cmd[0] = NANDFLASH_PROGRAM_LOAD;
    cmd[1] = (uint8_t)((pageOffset >> 8) & 0x0F);
    cmd[2] = (uint8_t)((pageOffset >> 0) & 0xFF);

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 3, SPI_TIMEOUT_DISABLE);
    SPI_Send_8bits(pNandflashCfg->spiNo, (uint8_t *)buff, writeLen, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    /*check block lock status*/
    Nandflash_Get_BlockLock(pNandflashCfg, &pBlockLock);

    if (pBlockLock != 0) {
        // MSG_ERR("Get BlockLock in Nandflash Program Load and return %0x\r\n", pBlockLock);
    }
}

void Nandflash_ProgramExecute(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t addr)
{
    uint8_t feature = 0;
    uint8_t cmd[4] = { 0 };
    uint8_t status = 0xff;
    uint8_t pBlockLock = 0xff;
    uint32_t absolutePageNum = 0;
    uint16_t cmds = 0;
    uint32_t blockNum = 0;
    uint32_t pageNum = 0;
    absolutePageNum = addr / NANDFLASH_PAGE_SIZE;
    blockNum = absolutePageNum / NANDFLASH_PAGES_PER_BLOCK;
    pageNum = absolutePageNum % NANDFLASH_PAGES_PER_BLOCK;

    /* enable ECC */
    Nandflash_Get_Feature(pNandflashCfg, &feature);
    ((NANDFLASH_FEATURE_Type *)(&feature))->ECC_EN = 1;
    Nandflash_Set_Feature(pNandflashCfg, &feature);

    /* program execute */
    cmd[0] = NANDFLASH_PROGRAM_EXECUTE;
    cmd[1] = NANDFLASH_DUMMY_BYTE;
    cmds = (uint16_t)(blockNum << 6) | (uint16_t)pageNum;
    cmd[2] = (uint8_t)(cmds >> 8);
    cmd[3] = (uint8_t)(cmds >> 0);

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 4, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    /*check block lock status*/
    Nandflash_Get_BlockLock(pNandflashCfg, &pBlockLock);

    if (pBlockLock != 0) {
        // MSG_ERR("Get BlockLock in Nandflash Program Execute and return %0x\r\n", pBlockLock);
    }

    /* Operation In Progress */
    do {
        Nandflash_Get_Status(pNandflashCfg, &status);
    } while ((((NANDFLASH_STATUS_Type *)(&status))->OIP));
}

void Nandflash_InternalDataMove(NANDFLASH_CFG_Type *pNandflashCfg)
{
}

void Nandflash_ProgramLoadRandomData(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t addr, uint8_t *buff, uint32_t len)
{
}

static void Nandflash_Erase(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t blockNum)
{
    uint8_t cmd[4] = { 0 };
    uint16_t cmds = 0;
    uint8_t pBlockLock = 0xff;

    /* block erase */
    cmd[0] = NANDFLASH_BLOCK_ERASE;
    cmd[1] = NANDFLASH_DUMMY_BYTE;
    cmds = (uint16_t)(blockNum << 6);
    cmd[2] = (uint8_t)(cmds >> 8);
    cmd[3] = (uint8_t)(cmds >> 0);

    Nandflash_CS_High();
    Nandflash_CS_Low();
    SPI_Send_8bits(pNandflashCfg->spiNo, cmd, 4, SPI_TIMEOUT_DISABLE);
    Nandflash_CS_High();

    /*check block lock status*/
    Nandflash_Get_BlockLock(pNandflashCfg, &pBlockLock);

    if (pBlockLock != 0) {
        // MSG_ERR("Get BlockLock in Nandflash Erase and return %0x\r\n", pBlockLock);
    }
}

void Nandflash_BlockErase(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t addr)
{
    uint8_t status = 0xff;
    uint32_t blockNum = 0;
    blockNum = addr / NANDFLASH_BLOCK_SIZE;

    Nandflash_WriteEnable(pNandflashCfg);
    Nandflash_Erase(pNandflashCfg, blockNum);

    /* Operation In Progress */
    do {
        Nandflash_Get_Status(pNandflashCfg, &status);
    } while ((((NANDFLASH_STATUS_Type *)(&status))->OIP));
}

void Nandflash_Reset(NANDFLASH_CFG_Type *pNandflashCfg)
{
}

void Nandflash_WriteUnprotect(NANDFLASH_CFG_Type *pNandflashCfg)
{
}

NANDFLASH_ECC_Type Nandflash_Check_ECC_Status(NANDFLASH_CFG_Type *pNandflashCfg)
{
    return NO_BIT_ERROR;
}

int Nandflash_Disk_Status(void)
{
    return 0;
}

int Nandflash_Disk_Initialize(void)
{
    return 0;
}

int Nandflash_Disk_Read(BYTE *buff, LBA_t sector, UINT count)
{
    //512 bytes in a sector
    uint32_t startAddr = sector * DISK_SECTOR_SIZE;
    uint32_t len = count * DISK_SECTOR_SIZE;
    NANDFLASH_ECC_Type ecc = 0;

    if (len > 0) {
        ecc = Nandflash_PagesRead(&nfCfg, startAddr, buff, len);
    }

