RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_snflash.c
    return 0;
}

void Nandflash_PageReadToPsram(uint32_t addr, uint32_t len)
{
    uint32_t startPageNum = 0, endPageNum = 0, absolutePageNum = 0;
    uint32_t beginAddr = addr, psramWriteOffsite = 0;
    uint8_t readBuff[NANDFLASH_PAGE_SIZE];

    startPageNum = addr / NANDFLASH_PAGE_SIZE;
    endPageNum = (addr + len - 1) / NANDFLASH_PAGE_SIZE;

    if (len > 0) {
        for (absolutePageNum = startPageNum; absolutePageNum <= endPageNum; absolutePageNum++) {
            memset(readBuff, 0, sizeof(readBuff));

            Nandflash_PageRead(&nfCfg, beginAddr, readBuff, NANDFLASH_PAGE_SIZE);
            Nandflash_Psram_Write(readBuff, NANDFLASH_PAGE_SIZE, psramWriteOffsite);

            beginAddr = (absolutePageNum + 1) * NANDFLASH_PAGE_SIZE;
            psramWriteOffsite += NANDFLASH_PAGE_SIZE;
        }
    }
}

static void Nandflash_PageWriteToPsram(const uint8_t *buff, uint32_t psramWriteOffsite, uint32_t len)
{
    if (len > 0) {
        return Nandflash_Psram_Write((uint8_t *)buff, len, psramWriteOffsite);
    }
}

static void Nandflash_PageProgramFromPsram(NANDFLASH_CFG_Type *pNandflashCfg, uint32_t blockNum)
{
    uint8_t psramReadBuf[NANDFLASH_PAGE_SIZE];
    uint32_t startPageNum = 0, endPageNum = 0, absolutePageNum = 0;
    uint32_t psramReadOffsite = 0;

    startPageNum = blockNum * NANDFLASH_PAGES_PER_BLOCK;
    endPageNum = (blockNum + 1) * NANDFLASH_PAGES_PER_BLOCK - 1;

    for (absolutePageNum = startPageNum; absolutePageNum <= endPageNum; absolutePageNum++) {
        memset(psramReadBuf, 0, NANDFLASH_PAGE_SIZE);
        Nandflash_Psram_Read(psramReadBuf, NANDFLASH_PAGE_SIZE, psramReadOffsite);
        Nandflash_PageProgram(pNandflashCfg, absolutePageNum * NANDFLASH_PAGE_SIZE, psramReadBuf, NANDFLASH_PAGE_SIZE);
        psramReadOffsite += NANDFLASH_PAGE_SIZE;
    }
}

int Nandflash_Disk_Write(const BYTE *buff, LBA_t sector, UINT count)
{
    uint32_t addr = sector * DISK_SECTOR_SIZE;
    uint32_t len = count * DISK_SECTOR_SIZE;
    uint32_t startBlockNum = 0, endBlockNum = 0, absoluteBlockNum = 0;
    uint32_t writeLen = 0, beginAddr = addr;

    startBlockNum = addr / NANDFLASH_BLOCK_SIZE;
    endBlockNum = (addr + len - 1) / NANDFLASH_BLOCK_SIZE;

    if (len > 0) {
        Nandflash_Psram_Cfg();

        for (absoluteBlockNum = startBlockNum; absoluteBlockNum <= endBlockNum; absoluteBlockNum++) {
            if (absoluteBlockNum == startBlockNum) {
                if (addr + len >= NANDFLASH_BLOCK_SIZE) {
                    writeLen = (absoluteBlockNum + 1) * NANDFLASH_BLOCK_SIZE - addr;
                } else {
                    writeLen = len;
                }
            } else if ((startBlockNum < absoluteBlockNum) && (absoluteBlockNum < endBlockNum)) {
                writeLen = NANDFLASH_BLOCK_SIZE;
            } else if (absoluteBlockNum == endBlockNum) {
                writeLen = (addr + len) - (endBlockNum * NANDFLASH_BLOCK_SIZE);
            }

            /*read data from block to psram*/
            Nandflash_PageReadToPsram(absoluteBlockNum * NANDFLASH_BLOCK_SIZE, NANDFLASH_BLOCK_SIZE);
            /*update program data to psram*/
            Nandflash_PageWriteToPsram(buff, beginAddr % NANDFLASH_BLOCK_SIZE, writeLen);
            /*erase block*/
            Nandflash_BlockErase(&nfCfg, absoluteBlockNum * NANDFLASH_BLOCK_SIZE);
            /*program data from psram to block*/
            Nandflash_PageProgramFromPsram(&nfCfg, absoluteBlockNum);

            buff += writeLen;
            beginAddr = (absoluteBlockNum + 1) * NANDFLASH_BLOCK_SIZE;
        }
    }

    return 0;
}

int Nandflash_Disk_Ioctl(BYTE cmd, void *buff)
{
    return 0;
}

void Nandflash_Init()
{
    Nandflash_Gpio_Init(SPI_PIN_CLK, SPI_PIN_MISO, SPI_PIN_MOSI);
    Nandflash_Clock_Init(ENABLE, 0x1F);
    Nandflash_SPI_Init(&nfCfg);
}
